<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
    <title>StyleCast</title>
    <!--bootstrap-->
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-+0n0xVW2eSR5OomGNYDnhzAbDsOXxcvSN1TPprVMTNDbiYZCxYbOOl7+AMvyTG2x" crossorigin="anonymous">
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.1/dist/js/bootstrap.bundle.min.js" integrity="sha384-gtEjrD/SeCtmISkJkNUaaKMoLD0//ElJ19smozuHV6z3Iehds+3Ulb9Bn9Plx0x4" crossorigin="anonymous"></script>
    <!--bootstrap end-->
    <link rel="preconnect" href="https://fonts.gstatic.com">
    <link href="https://fonts.googleapis.com/css2?family=Noto+Sans+KR:wght@300&display=swap" rel="stylesheet">
    <style>
         /*div{border: 1px solid gray; box-sizing: border-box;} */

        .wrap{
            width:1200px;
            height:1300px;
            margin: auto;
            position: relative;
            }
        h1,h2,h3{font-weight: bold;}
        *{font-family: 'Noto Sans KR', sans-serif;}
    </style>
</head>
<body>
    <div class="wrap" id="background">
        <p>
            <br>
            <h1>StyleCast 이용약관</h1>
            <div style="border: 1px solid gray; opacity: 60%;"></div>
            <br>
            StyleCast는 전 세계의 사람들과 서로 일상 속 패션 사진을 손쉽게 공유하여 피드백을 주고 받으며 트랜드를 한눈에 파악할 수 있는 패션 SNS입니다. StyleCast는 서비스이용자의 원활한 서비스 이용을 도모하기 위하여 본 서비스와 함께 약관을 제공합니다.StyleCast는 서비스이용자에게 약관을 검토 할 수 있는 합리적인 기회를 제공하였으며 회원은 본 약관에 동의하였음을 확인합니다.
            <br><br><br>

            <h2>제 1 장 총 칙</h2>
            <div style="border: 1px solid gray; opacity: 60%;"></div>
            <br>

            <h3>제1조 (목적)</h3>
            <br>
            본 약관은 주식회사 StyleCast가 제공하는 서비스 이용과 관련하여 StyleCast와 서비스이용자의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
            <br><br>

            <h3>제2조(약관의 명시, 효력 및 개정)</h3>
            <br>
            1. StyleCast는 이 약관의 내용을 서비스이용자가 쉽게 알 수 있도록 서비스에 게시하거나 기타의 방법으로 회원에게 공지함으로써 효력이 발생합니다.
            <br><br>
            2. StyleCast는 약관의 규제에관한법률, 정보통신망이용촉진및정보보호등에관한법률, 전자상거래등에서의소비자보호에관한법률, 소비자기본법 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
            <br><br>
            3. StyleCast가 약관을 개정 할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 제 1항의 방식에 따라 개정약관의 적용일자 30일 전부터 적용일자 전까지 공지합니다. 다만, 회원의 권리 또는 의무에 관한 중요한 규정의 변경일 경우에는 최소한 30일전에 공지하고 개정약관을 회원이 등록한 이메일로 발송하여 통지합니다.
            <br><br>
            4. StyleCast가 전항에 따라 개정약관을 공지 또는 통지하면서 약관 변경 적용일까지 거부의사를 표시하지 않으면 의사표시가 표명된다는 내용을 알렸음에도 불구하고 회원이 명시적으로 거부의사를 표시하지 아니하는 경우 회원이 개정약관에 동의한 것으로 간주합니다.
            <br><br>
            5. 회원이 변경된 약관에 동의하지 않는 경우 StyleCast는 개정 약관의 내용을 적용할 수 없으며 이 경우 회원은 서비스의 이용을 중단하고 이용계약을 해지 할 수 있습니다.
            <br><br>
            6. 이 약관에 동의하는 것은 정기적으로 StyleCast 웹사이트 및 모바일 어플리케이션을 통하여 약관의 변경사항 및 운영방침등을 확인하는 것에 동의하는 것을 의미합니다. 회원은 약관의 변경에 대하여 주의의무를 다 하여야하며, 변경된 약관의 부지로 인한 회원의 피해는 StyleCast가 책임지지 않습니다.
            <br><br>
            7. 약관 교부의무에 따라 서비스이용자가 요구할 경우 본 약관의 사본을 자택으로 보내드립니다.
            <br><br>

            <h3>제3조(약관외 준칙)</h3>
            <br>
            1. 본 약관에 명시되지 않은 사항에 대해서는 정보통신망 이용촉진 및 정보보호등에 관한 법률, 약관의 규제에 관한 법률, 전기통신사업법 등 관계 법령 및 회사가 정한 운영방침 등의 규정에 따릅니다.
            <br><br>
            2. 본 약관과 관련하여 회사의 정책변경, 운영방침, 법령의 제정 및 개정 또는 공공기관의 고시나 지침에 의하여 회사가 회원에 대한 통지수단을 통하여 공지하는 내용도 이용약관의 일부를 구성합니다.
            <br><br>
            
            <h3>제4조(용어의 정의)</h3>
            <br>
            본 약관에서 사용하는 용어의 정의는 다음과 같습니다. 정의되지 않은 용어에 대한 해석은 관계법령 및 서비스 별 안내에 정하는 바에 의합니다. 관계법령과 서비스 별 안내에서 정하지 않은 것은 일반적인 상관례에 따릅니다.
            <br><br>
            1.회사: StyleCast
            <br><br>
            2.이용고객: 서비스를 이용하기 위하여 StyleCast와 이용계약을 체결하려고 하는 자 및 회원계정을 가지지 않고(비회원) StyleCast 서비스를 이용하는 자.
            <br><br>
            3.회원: 본 약관에 동의한 자로 StyleCast와 이용계약을 체결하여 StyleCast의 계정을 가지고 있는 자
            <br><br>
            4.이용자: 이용고객과 회원을 지칭하는 단어
            <br><br>
            5.ID: 회원 식별과 서비스 이용을 위하여 회원이 선정하고 회사가 승인하는 문자, 특수문자, 숫자 등의 조합
            <br><br>
            6.비밀번호: 회원이 자신의 ID와 일치하는 이용 고객임을 확인하기 위해 선정한 문자, 특수문자, 숫자 등의 조합
            <br><br>
            7.콘텐츠: 부호, 문자, 도형, 색채, 음성, 음향, 이미지 및 영상등(이들의 복합체를 포함)의 자료 또는 정보
            <br><br>
            8.게시물: 회원이 StyleCast가 제공하는 서비스에 게시 또는 등록하는 부호(URL포함),문자, 이미지(사진포함), 파일등
            <br><br>
            9.게시자: 회원이 StyleCast가 제공하는 서비스 내에 게시물을 등록한 자
            <br><br>
            10.약관: 약관 규제에 관한 법률 제2조에 따라 그 명칭이나 형태 또는 범위에 상관 없이 계약의 한쪽 당사자가 여러 명의 상대방과 계약을 체결하기 위하여 일정한 형식으로 미리 마련한 계약의 내용
            <br><br><br>

            <h2>제 2 장 콘텐츠</h2>
            <div style="border: 1px solid gray; opacity: 60%;"></div>
            <br>
            StyleCast는 회원의 소중한 콘텐츠를 바탕으로 하는 서비스 입니다. 회원님의 콘텐츠가 StyleCast를 더욱 풍성하게 만들어 줍니다

            <br><br>
            <h3>제5조 (콘텐츠의 저작권)</h3>
            <br>
            1.회원이 서비스 내에 게시한 콘텐츠의 저작권은 해당 게시물의 저작자에게 귀속됩니다.
            <br><br>
            2.회원이 StyleCast에 게시한 콘텐츠는 저작권법에 의하여 보호를 받으며, StyleCast가 작성한 저작물에 대한 저작권 및 기타 지적재산권은 StyleCast에 귀속합니다.
            <br><br>
            3.회원은 게시한 콘텐츠의 저작권 및 기타 산업재산권을 갖고 있음을 명확히 합니다. 다만 회원은 본 서비스에 콘텐츠를 게시함으로써 StyleCast가 서비스 및 사업과 관련하여 해당 콘텐츠(및 그 2차적 저작물)의 일부 또는 전부를 전세계적으로 비독점적으로 무상으로 사용할 권리(이용, 공개, 반포, 광고, 출판, 복제, 공연, 공중송신, 전시, 배포, 대여, 2차저작물작성)를 허락하며 이를 양도 할 수 있음에 동의한 것으로 간주합니다.또한 StyleCast에 대해 저작인격권을 행사 하지 않을 것에 동의한 것으로 간주합니다. 이는 StyleCast가 무료로 이용되고 있는 이유입니다
            <br><br>

            <h3>제6조 (회원의 콘텐츠 행위)</h3>
            <br>
            1.콘텐츠행위란 회원이 StyleCast의 계정 보유자 자격으로 StyleCast에 사진 및 회원의 의견을 포함한 콘텐츠를 게시 하는 행위입니다.
            <br><br>
            2.회원의 콘텐츠행위는 다른 서비스이용자가 콘텐츠를 다운로드하여 열람하거나 개인의 가정에서 비영리적인 목적으로 사적 이용하는 것을 허락한 것으로 간주합니다.
            <br><br>
            3.회원은 본 약관에 어긋나지 않는 콘텐츠만을 게시 할 수 있습니다.
            <br><br>
            4.회원이 서비스 내에 게시하는 게시물은 검색결과 내지 서비스 및 관련 프로모션 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다
            <br><br>

            <h3>제7조 (콘텐츠의 관리 및 임시조치)</h3>
            <br>
            1.회원의 게시물이 정보통신망법 및 저작권법 등 관련법에 위반되는 내용을 포함하는 경우, 콘텐츠의 권리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청 할 수 있으며 StyleCast는 관련법에 따라 조치를 취하여야 합니다.
            <br><br>
            2.StyleCast는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 StyleCast 운영방침 및 관련법에 따라 해당 게시물에 대해 임시조치 등을 취할 수 있습니다.
            <br><br>
            3.StyleCast는 콘텐츠와 관련한 문제시에 게시물 삭제 및 게시자에게 경고조치를 즉시 취할 것입니다.
            <br><br>
            4.콘텐츠와 관련한 문제시에 StyleCast를 통해 임시조치를 요청 할 수 있습니다.
            <br><br><br>

            <h2>제 3 장 개인정보수집</h2>
            <div style="border: 1px solid gray; opacity: 60%;"></div>
            <br>
            StyleCast는 서비스를 제공하기 위하여 회원으로부터 필요한 개인정보를 수집합니다. 이와 관련한 자세한 사항은 개인정보취급방침을 따릅니다.

            <br><br>
            <h3>제8조 (회원정보의 보호 및 이용)</h3>
            <br>
            1.StyleCast는 정보통신망이용촉진및정보보호등에관한법률 등 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및 StyleCast의 개인정보취급방침이 적용됩니다. 다만, StyleCast의 공식 사이트 이외의 링크된 사이트에서는 StyleCast의 개인정보취급방침이 적용되지 않습니다.
            <br><br>
            2.StyleCast는 이용계약의 성립 및 이행에 필요한 최소한의 범위 내에서 개인정보취급방침에 따라 고객님의 회원정보를 수집합니다.
            <br><br>
            3.StyleCast는 이용자의 개인정보를 수집 및 이용하는 때에는 당해 이용자에게 그 목적을 고지하고 동의를 받습니다.
            <br><br>
            4.StyleCast는 서비스와 관련하여 알고 있는 회원의 정보를 본인의 동의 없이 제 3자에게 제공하지 않습니다. 다만, 다음의 경우는 예외로 합니다.
            <br><br>
            &nbsp; - 정보통신서비스의 제공에 관한 계약의 이행을 위하여 필요한 개인정보로서 경제적, 기술적인 사유로 통상의 동의를 받는 것이 현저히 곤란한 경우
            <br><br>
            &nbsp; - 도용 방지를 위하여 본인 확인에 필요한 경우
            <br><br>
            &nbsp; - 법률의 규정 또는 법률에 의하여 필요한 불가피한 사유가 있는 경우
            <br><br>
            &nbsp; - 신속한 이용문의 상담 및 이용자의 불만처리 업무에 필요한 이용자의 정보를 제공하는 경우
            <br><br>
            5.StyleCast는 회원의 귀책사유로 인해 노출된 회원 정보에 대해서 책임을 지지 않습니다.
            <br><br>
            6.회원이 이용계약 체결과정에서 StyleCast에 제공한 회원정보의 이용 또는 제공에 대한 동의를 철회하고자 하는 경우에는 개인정보취급방침에서 정한 바에 따르며, 이러한 동의를 철회하는 경우 서비스 이용계약은 자동으로 해지됩니다.
            <br><br>
            7.StyleCast는 회원정보의 취급 및 관리, 서비스 운영 등의 업무를 스스로 수행함을 원칙으로 하나, 필요한 경우 업무의 일부 또는 전부를 회사가 선정한 회사에 위탁할 수 있으며, 회원정보의 취급 및 관리, 서비스 운영 등에 관한 업무를 위탁하는 경우에는 개인정보취급방침에 공지합니다.
            <br><br>
            8.이용자는 언제든지 StyleCast가 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을 요구할 수 있으며, StyleCast는 이에 대해 지체 없이 필요한 조치를 취할 의무를 집니다. 이용자가 오류의 정정을 요구한 경우에는 StyleCast는 그 오류를 정정할 때까지 당해 개인정보를 이용하지 않습니다.
            <br><br><br>

            <h2>제 4 장 손해배상 등</h2>
            <div style="border: 1px solid gray; opacity: 60%;"></div>
            
            <br>
            <h3>제9조 (손해배상)</h3>
            <br>
            1.회원이 본 약관의 규정을 위반함으로 인하여 StyleCast에 손해가 발생하게 되는 경우, 본 약관을 위반한 회원은 StyleCast에 발생하는 모든 손해를 배상하여야 합니다.
            <br><br>
            2.회원이 서비스를 이용하는 과정에서 행한 불법행위나 본 약관 위반행위로 인하여 StyleCast가 당해 회원 이외의 제 3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받은 경우 당해 회원은 자신의 책임과 비용으로 StyleCast를 면책시켜야 하며, StyleCast가 면책되지 못한 경우 당해 회원은 그로인하여 StyleCast에 발생한 모든 손해를 배상하여야 합니다.
            <br><br>
            3.StyleCast는 무료로 제공하는 서비스와 관련하여 발생하는 사항에 대하는 어떠한 손해도 책임을 지지 않습니다.
            <br><br>

            <h3>제10조 (면책사항)</h3>
            <br>
            1.StyleCast는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면책됩니다.
            <br><br>
            2.StyleCast는 회원의 귀책사유로 인한 서비스의 중지 또는 이용장애에 대하여 책임을 지지 않습니다.
            <br><br>
            3.StyleCast는 이동통신 사업자가 네트워크서비스를 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우에는 책임이 면제됩니다.
            <br><br>
            4.StyleCast는 서비스이용자가 서비스를 이용하여 기대하는 수익을 얻지 못한 것에 대하여 책임을 지지 않으며 서비스에 대한 이용으로 발생하는 손해 등에 대해서는 책임이 면제됩니다.
            <br><br>
            5.StyleCast는 서비스이용자간 혹은 서비스이용자와 제 3자간에 본 서비스를 매개로 하여 발생한 분쟁에 대해 개입할 의무가 없으며 이로 인한 손해를 배상할 책임을 지지 않습니다.
            <br><br>
            6.StyleCast는 회원이 서비스내에서 게시 또는 전송한 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 대하여는 책임을 지지 않습니다.
            <br><br>
            7.StyleCast는 회원 상호간 또는 회원과 제 3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없으며 이로인한 손해를 배상할 책임도 없습니다.
            <br><br>
            8.StyleCast는 서비스이용자의 디바이스 환경으로 인하여 발생하는 제반 문제 또는 회사의 귀책사유가 없는 네트워크 환경으로 인하여 발생하는 문제에 대해서는 책임을 지지 않습니다.
            <br><br>

            <h3>제11조 (분쟁 조정 및 관할 법원)</h3>
            <br>
            1.StyleCast 서비스 이용과 관련하여 회사와 서비스이용자간에 발생한 분쟁에 대하여는 양 당사자 간의 합의에 의해 원만히 해결하여야 합니다.
            <br><br>
            2.회원은 게시물과 관련된 저작권침해, 명예훼손 또는 개인정보 및 서비스 이용과 관련된 사항에 관한 문제제기 또는 문제해결은 StyleCast가 운영하는 고객센터를 통하여 처리하여야 합니다.
            <br><br>
            3.StyleCast와 회원간 제기된 소송은 대한민국법을 준거법으로 합니다.
            <br><br>
            4.StyleCast와 회원간 발생한 분쟁에 관한 소송은 민사소송법 상의 관할법원에 제소합니다.
            <br><br><br>

            <h1>StyleCast 이용약관</h1>
            <div style="border: 1px solid gray; opacity: 60%;"></div>
            <br>
            이 약관은 2021년 6월 10일 부터 적용됩니다. 개정된 이용약관의 적용일자 이전 가입자 또한 개정된 이용약관의 적용을 받습니다.
            <br><br>
            본 약관에 문의사항이 있는 경우에는help@stylecast.com로 문의 주세요.
            <br><br>
            StyleCast..
            <br><br><br><br><br><br><br><br><br><br><br><br>
        </p>
    </div>
</body>
</html>